# MemberForces Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MemberForces Class
Members See Also
---
An object that represents a member forces on analytical element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class MemberForces : IDisposable
```

Visual Basic
---
```text
Public Class MemberForces _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MemberForces : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..MemberForces
# See Also
MemberForces Members
Autodesk.Revit.DB.Structure Namespace